
package kr.gaulim.lib.string.regexp;


public class REGEXP_KOR
{
    // 지번 주소 - /^(대한민국|한국)?\s?([경기상충청전라제주특별광역자치]+(?:(?:북|남)?도?))?\s?([가-힣]+시)?\s?([가-힣]+[구군])?\s?([가-힣]+(?:읍|면))?\s?([가-힣]+\d?(?:동|리))?\s?(산?(?:\d{1,4}(?:[\-]\d{1,3})?))?\s?([\w가-힣@]+)?\s?(\d{1,2}층)?(\d{1,4}(?:[/\-]|동\s)?\d{1,4}호?)?$/
    public static final String ADDR_LL = "^(대한민국|한국)?\\s?([경기상충청전라제주특별광역자치]+(?:(?:북|남)?도?))?\\s?([가-힣]+시)?\\s?([가-힣]+[구군])?\\s?([가-힣]+(?:읍|면))?\\s?([가-힣]+\\d?(?:동|리))?\\s?(산?(?:\\d{1,4}(?:[\\-]\\d{1,3})?))?\\s?([\\w가-힣@]+)?\\s?(\\d{1,2}층)?(\\d{1,4}(?:[/\\-]|동\\s)?\\d{1,4}호?)?$";

    // 도로명 주소 - /^(대한민국|한국)?\s?([경기상충청전라제주특별광역자치]+(?:(?:북|남)?도?))?\s?([가-힣]+시)?\s?([가-힣]+[구군])?\s?([가-힣]+(?:읍|면))?\s?([가-힣]+(?:대?로)?(?:\d*(?:가|나|다|라|마|바|사|아|자|차|카|타|파|하)?길)?)\s(\d{1,4}(?:[\-]\d{1,2})?)\s?([\(][가-힣\d]+(?:[,]\s[A-Za-z가-힣\d]+)?[\)])?\s?(\d{1,2}층)?(\d{1,4}(?:[/\-]|동\s)\d{1,4}호?)?\s?([\(\w가-힣\)]+)?$/
    public static final String ADDR_RN = "^(대한민국|한국)?\\s?([경기상충청전라제주특별광역자치]+(?:(?:북|남)?도?))?\\s?([가-힣]+시)?\\s?([가-힣]+[구군])?\\s?([가-힣]+(?:읍|면))?\\s?([가-힣]+(?:대?로)?(?:\\d*(?:가|나|다|라|마|바|사|아|자|차|카|타|파|하)?길)?)\\s(\\d{1,4}(?:[\\-]\\d{1,2})?)\\s?([\\(][가-힣\\d]+(?:[,]\\s[A-Za-z가-힣\\d]+)?[\\)])?\\s?(\\d{1,2}층)?(\\d{1,4}(?:[/\\-]|동\\s)\\d{1,4}호?)?\\s?([\\(\\w가-힣\\)]+)?$";

    // 통화 - /^[$]?((?:[1-9]\d{0,2}(?:[,]\d{3})*|[1-9]\d*|0)(?:[.]\d*)?)$/
    public static final String CURRENCY = "^[$]?((?:[1-9]\\d{0,2}(?:[,]\\d{3})*|[1-9]\\d*|0)(?:[.]\\d*)?)$";

    // 휴대폰번호 - /^[+]?(82)?[\x20\-]?[\(]?[0]?[\)]?[\x20\-]?(1[0-16-9]{1})\-?(\d{4})\-?(\d{4})$/
    public static final String MOBILE_NUM = "^[+]?(82)?[\\x20\\-]?[\\(]?[0]?[\\)]?[\\x20\\-]?(1[0-16-9]{1})\\-?(\\d{4})\\-?(\\d{4})$";

    // 전화번호 - /^[+]?(82)?[\x20\-]?[\(]?0?[\)]?[\x20\-]?(2|10|[3-9]{1}\d{1})?[\)\-]?(\d{3,4})\-?(\d{4})$/
    public static final String PHONE_NUM = "^[+]?(82)?[\\x20\\-]?[\\(]?0?[\\)]?[\\x20\\-]?(2|10|[3-9]{1}\\d{1})?[\\)\\-]?(\\d{3,4})\\-?(\\d{4})$";

    // 주민등록번호 - /^(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12]\d|3[01])\-?([01-49]{1})(\d{2})(\d{2})(\d)(\d)$/
    public static final String RRN = "^(\\d{2})(0[1-9]|1[0-2])(0[1-9]|[12]\\d|3[01])\\-?([01-49]{1})(\\d{2})(\\d{2})(\\d)(\\d)$";


    private REGEXP_KOR() { }

    // End of REGEXP_KOR.class
}

// End of REGEXP_KOR.java

